In [65]:
import pandas as pd

In [66]:
dic_01 = {'A':[1, 2, 3],
          'B':[-32, -21, -15],
          'C':[60, 10, 20],
          'Chave':['AA', 'BB', 'CC']
          }

In [67]:
dic_02 = {'A':[6, 7, 8],
          'B':[-39, -28, -17],
          'C':[1000, 10, 60],
          'Chave':['AA', 'BB', 'CC']
          }

In [69]:
#criar um label, um pra cada linha

Label_01=['1ª Linha', '2ª Linha', '3ª Linha']
Label_02=['4ª Linha', '5ª Linha', '6ª Linha']
Label_03=['7ª Linha', '8ª Linha', '9ª Linha']

In [79]:
df1=pd.DataFrame(dic_01, index=Label_01)
df2=pd.DataFrame(dic_02, index=Label_02)
df3=pd.DataFrame(dic_03, index=Label_03)

In [71]:
df2.drop('6ª Linha', axis=0, inplace=False)

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB

In [72]:
df1

          A   B   C Chave
1ª Linha  1 -32  60    AA
2ª Linha  2 -21  10    BB
3ª Linha  3 -15  20    CC

In [73]:
df2

          A   B     C Chave
4ª Linha  6 -39  1000    AA
5ª Linha  7 -28    10    BB
6ª Linha  8 -17    60    CC

In [74]:
df3

           A   B   C Chave
7ª Linha  11 -39  30    AA
8ª Linha  12 -22  10    BB
9ª Linha  13 -11  20    CC

In [75]:
#concatenar o dataframe / juntar

pd.concat([df1, df2, df3])

           A   B     C Chave
1ª Linha   1 -32    60    AA
2ª Linha   2 -21    10    BB
3ª Linha   3 -15    20    CC
4ª Linha   6 -39  1000    AA
5ª Linha   7 -28    10    BB
6ª Linha   8 -17    60    CC
7ª Linha  11 -39    30    AA
8ª Linha  12 -22    10    BB
9ª Linha  13 -11    20    CC

In [68]:
dic_03 = {'A':[11, 12, 13],
          'B':[-39, -22, -11],
          'C':[30, 10, 20],
          'Chave':['AA', 'BB', 'CC']
          }

In [78]:
pd.merge(df1, df3, how='outer', on='Chave')  #mesclar dois data frame = focar na chave

   A_x  B_x  C_x Chave  A_y  B_y  C_y
0    1  -32   60    AA   11  -39   30
1    2  -21   10    BB   12  -22   10
2    3  -15   20    CC   13  -11   20

In [ ]:
dic_01 = {'A':[1, 2, 3],
          'B':[-32, -21, -15],
          'C':[60, 10, 20],
          'Chave':['AA', 'BB', 'CC']
          }

In [ ]:
dic_02 = {'A':[6, 7, 8],
          'B':[-39, -28, -17],
          'C':[1000, 10, 60],
          'Chave':['AA', 'BB', 'CC']
          }

In [ ]:
dic_03 = {'A':[11, 12, 13],
          'B':[-39, -22, -11],
          'C':[30, 10, 20],
          'Chave':['AA', 'BB', 'CC']
          }

In [81]:
dic_001 = {'Cliente':[1, 2, 3],
           'Produto': ['arroz', 'feijão', 'carne'],
           'Qtde': ['5', '2', '3']
           }

In [80]:
dic_002 = {'Supermercado':['pague menos', 'covabra', 'enxuto'],
           'Filial': [10, 50, 25],
           'Qtde_vendas': [200, 600, 300]
           }

In [82]:
label = [0, 1, 2]

In [83]:
df_m1 = pd.DataFrame(dic_001, index=label)
df_m2 = pd.DataFrame(dic_002, index=label)

In [84]:
df_m1

   Cliente Produto Qtde
0        1   arroz    5
1        2  feijão    2
2        3   carne    3

In [85]:
df_m2

  Supermercado  Filial  Qtde_vendas
0  pague menos      10          200
1      covabra      50          600
2       enxuto      25          300

In [86]:
df_m1.join(df_m2) #juntar os lados

   Cliente Produto Qtde Supermercado  Filial  Qtde_vendas
0        1   arroz    5  pague menos      10          200
1        2  feijão    2      covabra      50          600
2        3   carne    3       enxuto      25          300

In [88]:
#calcular estatiscas do data frame  .describe()
df_m2.describe()

          Filial  Qtde_vendas
count   3.000000     3.000000
mean   28.333333   366.666667
std    20.207259   208.166600
min    10.000000   200.000000
25%    17.500000   250.000000
50%    25.000000   300.000000
75%    37.500000   450.000000
max    50.000000   600.000000

In [91]:
df_m1.head(1) #ler inicio do nosso dataframe

   Cliente Produto Qtde
0        1   arroz    5

In [90]:
df_m1.tail(1) #ler ultima linha

   Cliente Produto Qtde
2        3   carne    3